app/Http/helpers.php

select * from `categories` where `category_id` is null
---
    function allCats(){
        return Category::where('category_id', NULL)->get();