@extends('layouts.app')

@section('content')
<div class="container">
    <h1 class="mt-5">الشروط والاحكام</h1>
    <br/>
    <p style="font-size: 16px">سياسة الخصوصية
    
        حماية بياناتك بالنسبة إلينا أمر في بالغ الأهمية، لهذا عند زيارتكم لمتجر " الذهبية للذبائح  " أو البدء بتقديم المعلومات من خلال نظام خدمة العملاء المرتبط به يعتبر هذا موافقة كاملة منكم على جميع شروط وأحكام المتجر القانونية، حيث نقوم بالاحتفاظ بالبيانات وفق القانون واستخدامها لأغراض جمعت من أجلها. 
        <br/>
        
        
        يمكنك تصفح متجر الذهبية للذبائح بدون أي حاجة لتقديم بياناتك الشخصية ولا يتم الكشف عن هويتك خلال فترة الزيارة والتصفح، إلا في حالة استخدام حساب إلكتروني مخصص مع اسم مستخدم وكلمة المرور تدخل بواسطتها إلى المتجر.
        <br/>
        
        
        البيانات التي نجمعها:<br/>
        
        نحتاج لجمع البيانات الخاصة بك في حال البدء بطلب شراء منتج من المتجر وتتم عملية الجمع لتوفير أفضل تجربة وخدمة لكم فقط.<br/>
        
        البيانات الشخصية التي نقوم بجمعها تتضمن على سبيل المثال:<br/>
        
        - الاسم<br/>
        
        - عنوان البريد الالكتروني<br/>
        
        - عنوان التسليم<br/>
        
        - رقم الجوال <br/>
    
        - تفاصيل الدفع<br/>
        
        
        نقوم باستخدام هذه المعلومات كي نتمكن من تنفيذ طلبك بأفضل شكل وتزويدك بخدمات ومنتجات تطلبها أنت من المتجر، بالإضافة إلى أننا سنستخدم المعلومات التي تقدمها في إدارة حسابك معنا والتحقق من صحة المعاملات المالية التي تجريها على المتجر.
        <br/>
        
        
        
        
        قد نوفر بياناتك الشخصية وعنوانك إلى طرف ثالث بهدف إتمام عمليات التسليم والخدمة مثلا ( مندوب التوصيل)
        <br/>
        
        خصوصية حسابك:<br/>
        
        أنت مسؤول عن المحافظة على سرية بياناتك وكلمة المرور الخاصة بحسابك وتحديد من يمكنه الوصول والتحكم بحسابك، بالإضافة إلى أنك توافق على قبول المسؤولية عن جميع الأنشطة التي تتم من خلال حسابك أو كلمة المرور الخاصة بك لدى متجرنا " الذهبية للذبائح" .
        
        <br/>
        
        حماية المعلومات<br/>
        
        نحن ملتزمون بضمان تام على حماية معلوماتك الخاصة من الوصول أو الكشف من أي جهة غير مصرح لها بذلك.
        <br/>
        
        ملفات الكوكيز وكيف نستخدمها<br/>
        
        ملفات الكوكيز: هي ملفات صغيرة يطلب منك السماح بوضعها على القرص الصلب لجهاز الكمبيوتر الخاص بك، بمجرد الموافقة عليها، يساعدنا ذلك على تحليل حركة المرور والزيارات لموقع معين، ملفات الكوكيز تسمح لتطبيقات الويب للرد عليك كفرد وعليه يتم تخصيص التطبيق حسب احتياجك وحسب خياراتك السابقة والبضائع التي نالت إعجابك من أجل توفير أفضل تجربة تسوق لك.
        
        
        يتم استخدام هذه البيانات لأغراض تحليل إحصائية وتسويقية ومن ثم يتم إزالة البيانات من النظام.
        
        الهدف من ملفات الكوكيز تقديم خدمة أفضل من خلال رصد الصفحات المفيدة لك أو غير ذلك.
        
        
        ملفات الكوكيز بأي حال لا تتيح لنا الوصول إلى جهاز الكمبيوتر الخاص بك أو أي معلومات عنك ، وغيرها من البيانات التي لم تختر مشاركتها معنا .
        
        يمكنك اختيار قبول أو رفض ملفات الكوكيز .
        
        <br/>
        
        معظم المتصفحات الإلكترونية تقبل ملفات الكوكيز ولكن بإمكانك تعديل إعدادات المتصفح لرفض ملفات الكوكيز إذا كنت تفضل ذلك مما قد يمنعك من الاستفادة الكاملة من الموقع.
        
        <br/>
        
        سياسة الخصوصية وسرية المعلومات <br/>
        
        يرحب بكم فريق عمل متجر " الذهبية للذبائح" ويقدم إليكم أحر التحيات والشكر على ثقتكم بالمتجر، " الذهبية للذبائح" يحرص ويدرك بشكل تام على حقوق المستخدم، ويسعى المتجر إلى الحفاظ على المعلومات الخاصة بالمستخدمين وفق آلية سياسية الخصوصية وسرية المعلومات المعمول بها، يوضح لكم بأن سياسة الخصوصية وسرية المعلومات التي سيتم التعامل مع معلوماتكم الخاصة بكم بموجبها كما يلي: 
        
        <br/>
        
        السياسة<br/>
        
        أولا: هل متجر " الذهبية للذبايح" يشارك هذه المعلومات؟ <br/>
        
        يسعى متجر " الذهبية للذبائح" بالاحتفاظ بهذه المعلومات بما يحفظ خصوصية المستخدم، متجر الو لحمه لا يحتفظ بهذه البيانات إلا بهدف التحسين وتقديم أفضل تجربة للمستخدم. 
        
        جميع المعلومات المجمعة لا يتم الإطلاع عليها إلا من قبل المختصين ولن يقوموا بنشر أو بث أي منها للغير.
        
        في حالة مشاهدة وتتبع أي نشاط غير شرعي أو غير قانوني فإن متجر" الذهبية للذبائح" قد يقوم بإبلاغ الجهات المختصة.
        <br/>
        
        
        ثانيا : ما هو مدى أمان سرية المعلومات الخاصة بالمتجر؟<br/>
        
        1. يسعى متجر الذهبية للذبايح إلى حفظ سرية المعلومات وسياسة الخصوصية الخاصة بالمستخدمين و لن تخالف أحكام هذه القواعد والسياسة. ولكن نظراً لعدم إمكانية ضمان ذلك 100% عبر وسائل الإنترنت فإن فريق عمل متجر " الذهبية للذبايح " ينوّه بما يلي:
        
        يسعى متجر الذهبية للذبايح بالحفاظ على جميع المعلومات الخاصة بالمستخدم وألا يطلع عليها أحد بما يخالف هذه السياسة المعمول بها في المتجر.
        
        <br/>
        
        غير أنه نظراً لأن شبكة الإنترنت لا يمكن ضمانها 100% لما قد يطرأ من اختراق أو فيروسات على أنظمة الحماية الالكترونية و على جدران الحماية المعمول به في متجر (الذهبية للذبائح) فإن المتجر ينصح المستخدمين بالحفاظ على معلوماتهم بسرية تامة، وعدم إفشاء أي معلومات يراها المستخدم هامة جداً له.
        
        
        <br/>
        
        
        ثالثا: هل هناك طرف ثالث في العلاقة بين (متجر الذهبية للذبائح ) والمستخدم عميل والتاجر؟
        
        
        "تحدد سياسة الخصوصية في هذه البنود المرفقة الحالات التي يتم بها دراسة البيانات المجمعة من قبل فريق عمل المتجر من أجل تقديم أفضل جودة خدمات في المتجر.</p>
    
</div>

@endsection
