app/Http/Controllers/Api/CategoryController.php

    public function index()
    {
        $cats = Category::with(['child', 'parent', 'products', 'child.products'])->where('category_id', NULL)->get();

        $products = Product::whereIn('id', [1,2,16,52,17,18])->get();
---
select * from `categories` where `categories`.`category_id` in (1, 2, 3, 4, 5, 11, 12, 13, 14, 15, 16, 17)
select * from `products` where `id` in (1, 2, 16, 52, 17, 18)

    public function product($id)
    {
        try {
            $product = Product::with(['products','options', 'category'])->find($id);
---
select * from `categories` where `categories`.`id` in (6)
select `options`.*, `option_product`.`product_id` as `pivot_product_id`, `option_product`.`option_id` as `pivot_option_id` from `options` inner join `option_product` on `options`.`id` = `option_product`.`option_id` where `option_product`.`product_id` in (1)
select * from `products` where `id` in (1, 2, 16, 52, 17, 18)

    public function register(Request $request) {

        $request->validate([
            'phone' => 'required|numeric'
        ]);

        $user = User::firstOrCreate([
            'phone' => $request->phone
        ]);
---
select * from `users` where (`phone` = '+201124928786') limit 1

    public function aboutUs() {
        try {

            $set = Settings::first();
---
select * from `settings` limit 1

    public function categories() {

        $cats = Category::with(['child', 'parent', 'products', 'child.products'])->where('category_id', NULL)->get();
---
select * from `categories` where `categories`.`category_id` in (1, 2, 3, 4, 5, 11, 12, 13, 14, 15, 16, 17)
select * from `products` where `products`.`category_id` in (6, 7, 8, 9, 10)

    public function category($id) {
        try {

            $cat = Category::find($id);
            $ids = $cat->child->pluck('id')->toArray();

            $products = Product::whereIn('category_id', $ids)->orWhere('category_id', $id)->get();
---
select * from `categories` where `categories`.`category_id` = 5 and `categories`.`category_id` is not null
select * from `products` where 0 = 1 or `category_id` = '5'