app/Http/Controllers/HomeController.php

    public function index()
    {
        $cats = Category::with(['child', 'parent', 'products', 'child.products'])->where('category_id', NULL)->get();

        $products = Product::whereIn('id', [1,2,16,52,17,18])->get();

        $sliders = Slider::latest()->get();
---
select * from `categories` where `categories`.`category_id` in (1, 2, 3, 4, 5, 11, 12, 13, 14, 15, 16, 17)
select * from `products` where `products`.`category_id` in (6, 7, 8, 9, 10)
select * from `products` where `id` in (1, 2, 16, 52, 17, 18)
select * from `sliders` order by `created_at` desc